/*
    목표: 자연수 n을 124 나라에서 사용하는 숫자로 바꾸기
    
    조건1: 숫자를 1,2,4로만 표현
    [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15, ...]
*/

/*
    3진법: 0,1,2로 표현
    ex) 9/3 = 3..0
        3/3 = 1..0
        => 100(3)
    
    124진법: 1,2,4로 표현
    ex) 9/3 = 3..0 -> (3-1)..(0+4) -> 2..4  
        2/3 = 0..2
        =>  24 (124)
        
        12/3 = 4..0 -> (4-1)..(0+4) -> 3..4
        3/3 = 1..0 -> (1-1)..(0+4) -> 0..4
        => 44 (124)
        
        25/3 = 8..1
        8/3 = 2..2
        2/3 = 0..2
        => 221 (124)
        
    결론: 1->1, 2->2, 0->4 (몫-1)
*/

function solution(n) {
    const answer = [];
    
    while(n>0){
        let divide = Math.floor(n / 3);
        const mod = n % 3;
        if(mod===0){
            answer.push(4);
            n = Math.floor(n/3)-1;
        }
        else{
            answer.push(mod);
            n = Math.floor(n/3);
        }
        
    }
    return answer.reverse().join('');
}